// Exercise_1_2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

//Задание 1.2 Напишите фрагмент кода, который реализует с помощью if (if/else)
//следующую логику: 
//если x меньше или равен 0, y=0
//если x больше 0 но меньше 1, то y=x,
//если x больше или равен 1, то y=1
//Подумайте: какого типа должны или могут быть x и y?

int main()
{
    double x = 1, y = 0;

    if (x <= 0) 
    {
        y = 0;
    }else if (x > 0 && x < 1)
    {
        y = x;
    }
    else if (x >= 1) 
    {
        y = 1;
    }

    std::cout << y << std::endl;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
