// Exercise_1_3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

//Задание 1.3 Напишите фрагмент кода, который реализует с помощью switch
//следующую логику: 
//в переменной cInput типа char дано значение символа,введенного любым способом.
//Если введен символ 'y' (т.е. yes) в любом регистре, то присвоить
//переменной у значение переменной x
//Если введен символ 'n' (т.е. no) в любом регистре, то присвоить
//переменной у значение (x * 2)
//Если любой другой симол, то вывести сообщение об ошибке

int main()
{
	double x = 2, y = 0;
	char cInput;

	std::cout << "Enter y or n: ";
	std::cin >> cInput;

	switch (cInput) 
	{
		case 'y':
		case 'Y':
			y += x;
			std::cout << y << std::endl;
			break;
		case 'n':
		case 'N':
			y = x * 2;
			std::cout << y << std::endl;
			break;
		default:
			std::cout << "Error" << std::endl;
			break;
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
