// Exercise_5_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

//Задание 5 Побитовая арифметика (and, or, xor, not), сдвиги.

int main()
{
	//а)Задайте значение номера бита с помощью потока ввода. Желательно контролировать корректность ввода
	size_t num_bit;
	//Однобайтовое значение, маска тоже будет однобайтовая. Ноль - младший бит, 7 - старший
	std::cout << "Please, enter bit number: ";
	do 
	{
		std::cin >> num_bit; //указываем бит, с которым будут производиться дальнейшие действия

		if (!(num_bit >= 0 && num_bit <= 7)) 
		{
			std::cout << "Error. Please, enter bit number: ";
		}
	} while (!(num_bit >= 0 && num_bit <= 7));

	//б)  в переменной val обнулите значение бита, заданного переменной num_bit
	{
		char val = 0xff;
		unsigned char mask = ~(1 << num_bit);
		char result = val & mask;
		std::cout << result << std::endl;
	}

	//в)  в переменной val определите значение бита, заданного переменной num_bit	
	{
		char val = 0xAA;
		unsigned char mask = 1 << num_bit;
		char x = val & mask;
		char result2 = x >> num_bit;
		std::cout << result2 << std::endl;
	}
		//г)	в переменной val установите  в 1 значение бита, заданного переменной num_bit	
	{
	char val = 0;
	unsigned char mask = 1 << num_bit;
	char result3 = val | mask;
	std::cout << result3 << std::endl;
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
