// Exercise_5_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

//Задание 5 Побитовая арифметика (and, or, xor, not), сдвиги.

int main()
{
	//а)Задайте значение номера бита с помощью потока ввода. Желательно контролировать корректность ввода
	size_t num_bit;
	std::cin >> num_bit;
	std::cout << num_bit << std::endl;

	//б)  в переменной val обнулите значение бита, заданного переменной num_bit
	{
		char val = 0xff;
	}

	//в)  в переменной val определите значение бита, заданного переменной num_bit	
	{
		char val = 0xAA;

	}
		//г)	в переменной val установите  в 1 значение бита, заданного переменной num_bit	
	{
	char val = 0;

	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
